In [1]:
import pandas as pd
from sqlalchemy import create_engine, text
from faker import Faker
import random

In [2]:
# Define the database URL
db_url = "postgresql://postgres:postgres@localhost:5432/EmployeeManagement"

In [3]:
# Create the engine object
engine = create_engine(db_url)

In [4]:
# Instantiate the Faker generator
fake = Faker()

In [5]:
# # Drop the existing tables

# with engine.connect() as connection:
#     connection.execute('DROP TABLE IF EXISTS contract_projects CASCADE')
#     connection.execute('DROP TABLE IF EXISTS work_locations CASCADE')
#     connection.execute('DROP TABLE IF EXISTS educations CASCADE')
#     connection.execute('DROP TABLE IF EXISTS clearances CASCADE')
#     connection.execute('DROP TABLE IF EXISTS employees CASCADE')
#     connection.execute('DROP TABLE IF EXISTS certifications CASCADE')

In [6]:
# Generate dummy data for contract projects
contract_projects = [{'contract_project_id': i+1, 'name': fake.job()} for i in range(10)]
contract_projects_df = pd.DataFrame(contract_projects)
contract_projects_df.to_sql('contract_projects', engine, if_exists='replace', index=False)

# Generate dummy data for work locations
work_locations = [{'work_location_id': i+1, 'name': fake.city()} for i in range(5)]
work_locations_df = pd.DataFrame(work_locations)
work_locations_df.to_sql('work_locations', engine, if_exists='replace', index=False)

# Generate dummy data for educations
educations = [{'education_id': i+1, 'level': level} for i, level in enumerate(["High School", "Bachelor's", "Master's", "Ph.D."])]
educations_df = pd.DataFrame(educations)
educations_df.to_sql('educations', engine, if_exists='replace', index=False)

# Generate dummy data for clearances
clearances = [{'clearance_id': i+1, 'level': level, 'status': status} for i, level in enumerate(["Confidential", "Secret", "Top Secret"])
              for status in ["Active", "Inactive"]]
clearances_df = pd.DataFrame(clearances)
clearances_df.to_sql('clearances', engine, if_exists='replace', index=False)

# Generate dummy data for certifications
certifications = [{'name': 'Certification 1', 'description': 'Description 1'},
                  {'name': 'Certification 2', 'description': 'Description 2'},
                  {'name': 'Certification 3', 'description': 'Description 3'},
                  # Add more certifications as needed
                 ]
certifications_df = pd.DataFrame(certifications)
certifications_df.to_sql('certifications', engine, if_exists='replace', index=False)

# Generate dummy data for employees
employees_data = []
for _ in range(150):
    contract_project_id = random.randint(1, len(contract_projects))
    work_location_id = random.randint(1, len(work_locations))
    years_of_experience = random.randint(0, 30)
    education_id = random.randint(1, len(educations))
    clearance_id = random.randint(1, len(clearances))
    origination_date = fake.date_between(start_date='-5y', end_date='today')
    reinvestigation_date = fake.date_between(start_date=origination_date, end_date='today')
    name = fake.name()
    certification_id = random.randint(1, len(certifications))
    
    employees_data.append({
        'name': name,
        'contract_project_id': contract_project_id,
        'work_location_id': work_location_id,
        'years_of_experience': years_of_experience,
        'education_id': education_id,
        'clearance_id': clearance_id,
        'origination_date': origination_date,
        'reinvestigation_date': reinvestigation_date,
        'certification_id': certification_id
    })

employees_df = pd.DataFrame(employees_data)

# Add foreign key columns from related tables
employees_df['clearance_id'] = employees_df['clearance_id'].apply(lambda x: clearances_df.loc[x-1, 'clearance_id'])
employees_df['contract_project_id'] = employees_df['contract_project_id'].apply(lambda x: contract_projects_df.loc[x-1, 'contract_project_id'])
employees_df['education_id'] = employees_df['education_id'].apply(lambda x: educations_df.loc[x-1, 'education_id'])
employees_df['work_location_id'] = employees_df['work_location_id'].apply(lambda x: work_locations_df.loc[x-1, 'work_location_id'])
employees_df['certification_id'] = employees_df['certification_id'].apply(lambda x: certifications_df.loc[x-1, 'name'])

employees_df.to_sql('employees', engine, if_exists='replace', index=False)

print("Dummy data inserted successfully.")

Dummy data inserted successfully.

In [7]:
# Join employees table with related tables to retrieve the desired columns
query = text('''
    SELECT e.name AS employee_name, cp.name AS contract_project_name, wl.name AS work_location_name,
           e.years_of_experience, ed.level AS education_level, cl.level AS clearance_level,
           e.origination_date, e.reinvestigation_date, c.name AS certification_name
    FROM employees e
    INNER JOIN contract_projects cp ON e.contract_project_id = cp.contract_project_id
    INNER JOIN work_locations wl ON e.work_location_id = wl.work_location_id
    INNER JOIN educations ed ON e.education_id = ed.education_id
    INNER JOIN clearances cl ON e.clearance_id = cl.clearance_id
    INNER JOIN certifications c ON e.certification_id = c.name
''')

# Create a connection from the engine
with engine.connect() as connection:
    # Execute the query and fetch the results
    result = connection.execute(query)

    # Convert the result to a Pandas DataFrame
    result_df = pd.DataFrame(result.fetchall(), columns=[
        'Employee Name', 'Contract Project', 'Work Location', 'Years of Experience',
        'Education Level', 'Clearance Level', 'Origination Date', 'Reinvestigation Date',
        'Certification Name'
    ])

# Drop duplicate rows from the result_df DataFrame
result_df = result_df.drop_duplicates()

# reset index
result_df.reset_index(inplace=True)

# drop index column
result_df = result_df.drop(columns=['index'])

# Display the DataFrame
result_df

,Employee Name,Contract Project,Work Location,Years of Experience,Education Level,Clearance Level,Origination Date,Reinvestigation Date,Certification Name
0,Robert Warren,Physiotherapist,Davisbury,12,High School,Top Secret,2020-12-30,2021-09-14,Certification 2
1,Gregory Montgomery,Physiotherapist,Angelaton,28,High School,Top Secret,2022-02-05,2022-12-06,Certification 2
2,Samantha Watson,Physiotherapist,South Karinamouth,23,Master's,Top Secret,2022-11-24,2022-12-13,Certification 1
3,Joshua Rice,Physiotherapist,Angelaton,26,High School,Secret,2018-08-01,2021-04-26,Certification 2
4,Steven Meyer,Physiotherapist,Lyonsland,16,Master's,Top Secret,2022-06-15,2023-04-02,Certification 1
...,...,...,...,...,...,...,...,...,...
145,Sandra Morgan,Secondary school teacher,South Karinamouth,21,Master's,Secret,2021-05-21,2022-01-20,Certification 1
146,Audrey Banks,Secondary school teacher,South Karinamouth,13,Ph.D.,Top Secret,2023-05-03,2023-05-28,Certification 2
147,Jesse Clements,Secondary school teacher,East Kevin,9,Master's,Secret,2021-07-06,2022-06-18,Certification 1
148,Mitchell Allen,Secondary school teacher,Lyonsland,19,Ph.D.,Secret,2021-09-23,2023-01-09,Certification 2
149,Mrs. Erica Turner,Secondary school teacher,Lyonsland,27,Ph.D.,Secret,2019-05-13,2021-12-18,Certification 1

In [8]:
# Create a new table in the database with the result_df DataFrame
result_df.to_sql('employeemanagementdb', engine, if_exists='replace', index=False)

print("New table created and added to the database.")

New table created and added to the database.

In [9]:
# Retrieve EmployeeManagementDB table:

# Query all employee names
query = "SELECT * FROM employeemanagementdb"
EmployeeManagementDB_df = pd.read_sql(query, engine)

# Display the result
EmployeeManagementDB_df

,Employee Name,Contract Project,Work Location,Years of Experience,Education Level,Clearance Level,Origination Date,Reinvestigation Date,Certification Name
0,Robert Warren,Physiotherapist,Davisbury,12,High School,Top Secret,2020-12-30,2021-09-14,Certification 2
1,Gregory Montgomery,Physiotherapist,Angelaton,28,High School,Top Secret,2022-02-05,2022-12-06,Certification 2
2,Samantha Watson,Physiotherapist,South Karinamouth,23,Master's,Top Secret,2022-11-24,2022-12-13,Certification 1
3,Joshua Rice,Physiotherapist,Angelaton,26,High School,Secret,2018-08-01,2021-04-26,Certification 2
4,Steven Meyer,Physiotherapist,Lyonsland,16,Master's,Top Secret,2022-06-15,2023-04-02,Certification 1
...,...,...,...,...,...,...,...,...,...
145,Sandra Morgan,Secondary school teacher,South Karinamouth,21,Master's,Secret,2021-05-21,2022-01-20,Certification 1
146,Audrey Banks,Secondary school teacher,South Karinamouth,13,Ph.D.,Top Secret,2023-05-03,2023-05-28,Certification 2
147,Jesse Clements,Secondary school teacher,East Kevin,9,Master's,Secret,2021-07-06,2022-06-18,Certification 1
148,Mitchell Allen,Secondary school teacher,Lyonsland,19,Ph.D.,Secret,2021-09-23,2023-01-09,Certification 2
149,Mrs. Erica Turner,Secondary school teacher,Lyonsland,27,Ph.D.,Secret,2019-05-13,2021-12-18,Certification 1

# Query Examplesreset_index

## Retrieve all employees' names:

In [10]:
# Retrieve all employees' names:

# Query all employee names
query = "SELECT * FROM employees"
employees_names_df = pd.read_sql(query, engine)

# Display the result
employees_names_df

,name,contract_project_id,work_location_id,years_of_experience,education_id,clearance_id,origination_date,reinvestigation_date,certification_id
0,Jeremy May,6,4,1,3,3,2022-05-15,2022-09-10,Certification 1
1,Katie Wright,1,5,30,4,3,2021-06-13,2021-10-29,Certification 3
2,Derek Webb,6,4,25,4,1,2020-11-06,2021-07-14,Certification 2
3,William Johnson,7,4,17,2,2,2019-06-27,2022-10-08,Certification 3
4,Amanda Gomez,3,4,9,4,3,2020-03-17,2022-08-30,Certification 3
...,...,...,...,...,...,...,...,...,...
145,Leslie Rivers,10,4,4,4,1,2023-02-05,2023-05-06,Certification 3
146,Andrew Murphy,4,2,26,1,3,2022-06-03,2023-03-13,Certification 1
147,Andrew Cook,10,5,20,2,2,2021-01-24,2022-06-18,Certification 3
148,Devin Diaz,4,3,22,1,1,2019-04-04,2021-04-06,Certification 1
149,Regina Harrington,6,5,6,4,1,2021-12-19,2022-12-17,Certification 1

## Retrieve the total number of employees:

In [11]:
# Retrieve the total number of employees:
query = """
SELECT COUNT(*) FROM employees;
"""

# Execute the query and fetch the data into a DataFrame
employee_count = pd.read_sql(query, engine)

# Display the result
print(employee_count)

   count
0    150

## Retrieve all employees with their corresponding contract project details:

In [12]:
# Retrieve all employees with their corresponding contract project details:

query = """
SELECT e.name, cp.name AS contract_project_name
FROM employees e
JOIN contract_projects cp ON e.contract_project_id = cp.contract_project_id;
"""
contract_project = pd.read_sql(query, engine)

# Display the result
contract_project

                   name     contract_project_name
0         Robert Warren           Physiotherapist
1          Craig Gordon           Physiotherapist
2          Steven Meyer           Physiotherapist
3         Jeremy Garcia           Physiotherapist
4    Gregory Montgomery           Physiotherapist
..                  ...                       ...
145        Maria Kaiser  Secondary school teacher
146       Michael Mason  Secondary school teacher
147       Jermaine Berg  Secondary school teacher
148    Jessica Thompson  Secondary school teacher
149      Katelyn Wagner  Secondary school teacher

[150 rows x 2 columns]

In [13]:
contract_project['contract_project_name'].unique()

array(['Physiotherapist', 'Accountant, chartered management',
       'Advertising art director', 'Aid worker',
       'Development worker, international aid',
       'Occupational psychologist', 'Editor, commissioning',
       'Forensic psychologist', 'Hotel manager',
       'Secondary school teacher'], dtype=object)

## Retrieve all employees with their corresponding work location details:

In [14]:
# Retrieve all employees with their corresponding work location details:

# Query employees with more than 10 years of experience and their work locations
query = """
SELECT e.name, wl.name AS work_location_name
FROM employees e
JOIN work_locations wl ON e.work_location_id = wl.work_location_id;
"""
employee_locations = pd.read_sql(query, engine)

# Display the result
employee_locations

                  name work_location_name
0    Mrs. Erica Turner          Lyonsland
1      Lindsay Raymond          Lyonsland
2       Curtis Elliott          Lyonsland
3          Vicki Jones          Lyonsland
4      Elizabeth Poole          Lyonsland
..                 ...                ...
145         Paul Wells         East Kevin
146     Gregory Taylor         East Kevin
147      Paul Lawrence         East Kevin
148       Stephen Hess         East Kevin
149       Katie Wright         East Kevin

[150 rows x 2 columns]

In [15]:
# Retrieve all employees with their corresponding education level:

query = """
SELECT e.name, ed.level AS education_level
FROM employees e
JOIN educations ed ON e.education_id = ed.education_id;
"""
education_level = pd.read_sql(query, engine)

# Display the result
education_level

               name education_level
0        Devin Diaz     High School
1     Andrew Murphy     High School
2    Ruben Gonzalez     High School
3     Larry Carroll     High School
4       Erika Brown     High School
..              ...             ...
145    Stephen Hess           Ph.D.
146    Dawn Burnett           Ph.D.
147    Amanda Gomez           Ph.D.
148      Derek Webb           Ph.D.
149    Katie Wright           Ph.D.

[150 rows x 2 columns]

In [16]:
# Retrieve all employees with their corresponding clearance level and status:

query = """
SELECT e.name, c.level AS clearance_level, c.status AS clearance_status
FROM employees e
JOIN clearances c ON e.clearance_id = c.clearance_id;
"""
clearance_level = pd.read_sql(query, engine)

# Display the result
clearance_level

                  name clearance_level clearance_status
0    Regina Harrington    Confidential           Active
1           Devin Diaz    Confidential           Active
2        Leslie Rivers    Confidential           Active
3        Monica Porter    Confidential           Active
4      Debbie Franklin    Confidential           Active
..                 ...             ...              ...
295      Emily Stewart      Top Secret         Inactive
296      Paul Lawrence      Top Secret         Inactive
297       Amanda Gomez      Top Secret         Inactive
298       Katie Wright      Top Secret         Inactive
299         Jeremy May      Top Secret         Inactive

[300 rows x 3 columns]

In [17]:
# Retrieve all employees who have a Top Secret clearance:

query = """
SELECT e.name
FROM employees e
JOIN clearances c ON e.clearance_id = c.clearance_id
WHERE c.level = 'Top Secret';
"""
top_clearance = pd.read_sql(query, engine)

# Display the result
top_clearance

                name
0         Jeremy May
1         Jeremy May
2       Katie Wright
3       Katie Wright
4       Amanda Gomez
..               ...
103  Lindsay Raymond
104      Erika Brown
105      Erika Brown
106    Andrew Murphy
107    Andrew Murphy

[108 rows x 1 columns]

In [18]:
# Retrieve all employees who are assigned to a specific contract project:

# query = """
# SELECT e.name
# FROM employees e
# JOIN contract_projects cp ON e.contract_project_id = cp.contract_project_id
# WHERE cp.name = 'Contract Project Name';
# """


query = """
SELECT e.name
FROM employees e
JOIN contract_projects cp ON e.contract_project_id = cp.contract_project_id
WHERE cp.name = 'Microbiologist';

"""
specific_contract_project = pd.read_sql(query, engine)

# Display the result
specific_contract_project

Empty DataFrame
Columns: [name]
Index: []

In [19]:
# Retrieve the average years of experience for employees:
query = """
SELECT AVG(years_of_experience) AS average_experience
FROM employees;
"""
average_experience = pd.read_sql(query, engine)

# Display the result
average_experience

   average_experience
0           15.326667

In [20]:
# Retrieve the count of employees per education level:

query = """
SELECT ed.level AS education_level, COUNT(*) AS employee_count
FROM employees e
JOIN educations ed ON e.education_id = ed.education_id
GROUP BY ed.level;
"""
employee_education_count = pd.read_sql(query, engine)

# Display the result
employee_education_count

  education_level  employee_count
0           Ph.D.              42
1        Master's              40
2     High School              44
3      Bachelor's              24

In [21]:
# Retrieve the employees who have an active clearance:
query = """
SELECT e.name
FROM employees e
JOIN clearances c ON e.clearance_id = c.clearance_id
WHERE c.status = 'Active';
"""
active_clearance= pd.read_sql(query, engine)

# Display the result
active_clearance

                  name
0           Jeremy May
1         Katie Wright
2           Derek Webb
3      William Johnson
4         Amanda Gomez
..                 ...
145      Leslie Rivers
146      Andrew Murphy
147        Andrew Cook
148         Devin Diaz
149  Regina Harrington

[150 rows x 1 columns]

In [22]:
# Retrieve the employees who have more than 10 years of experience:

query = """
SELECT e.name, e.years_of_experience
FROM employees e
WHERE e.years_of_experience > 10;
"""
over_10_years = pd.read_sql(query, engine)

# Display the result
over_10_years

                 name  years_of_experience
0        Katie Wright                   30
1          Derek Webb                   25
2     William Johnson                   17
3     Denise Johnston                   14
4       Emily Stewart                   29
..                ...                  ...
92  Mrs. Erica Turner                   27
93      Monica Porter                   12
94      Andrew Murphy                   26
95        Andrew Cook                   20
96         Devin Diaz                   22

[97 rows x 2 columns]

In [23]:
# Retrieve the count of employees per work location:

query = """
SELECT wl.name AS work_location, COUNT(*) AS employee_count
FROM employees e
JOIN work_locations wl ON e.work_location_id = wl.work_location_id
GROUP BY wl.name;
"""
employee_location_count = pd.read_sql(query, engine)

# Display the result
employee_location_count

       work_location  employee_count
0          Lyonsland              25
1          Davisbury              35
2          Angelaton              27
3         East Kevin              29
4  South Karinamouth              34

In [24]:
# Retrieve the average years of experience per contract project:

query = """
SELECT cp.name AS contract_project, AVG(e.years_of_experience) AS average_experience
FROM employees e
JOIN contract_projects cp ON e.contract_project_id = cp.contract_project_id
GROUP BY cp.name;
"""
average_years_exp_contract = pd.read_sql(query, engine)

# Display the result
average_years_exp_contract

                        contract_project  average_experience
0               Secondary school teacher           15.357143
1              Occupational psychologist           14.473684
2                  Editor, commissioning           15.666667
3                        Physiotherapist           20.000000
4                  Forensic psychologist           13.214286
5       Accountant, chartered management           15.642857
6                          Hotel manager           13.235294
7                             Aid worker           19.823529
8               Advertising art director           12.230769
9  Development worker, international aid           14.312500

In [25]:
# Retrieve the employees with their contract project, work location, and education level:

query = """
SELECT e.name, cp.name AS contract_project, wl.name AS work_location, ed.level AS education_level
FROM employees e
JOIN contract_projects cp ON e.contract_project_id = cp.contract_project_id
JOIN work_locations wl ON e.work_location_id = wl.work_location_id
JOIN educations ed ON e.education_id = ed.education_id;
"""
contract_project_location_education = pd.read_sql(query, engine)

# Display the result
contract_project_location_education

,name,contract_project,work_location,education_level
0,Robin Richardson,Occupational psychologist,South Karinamouth,High School
1,Amber Jensen,"Accountant, chartered management",East Kevin,High School
2,Erika Brown,Forensic psychologist,South Karinamouth,High School
3,Miranda Holder,"Editor, commissioning",South Karinamouth,High School
4,Melanie Clark,Advertising art director,East Kevin,High School
...,...,...,...,...
145,Dawn Burnett,"Development worker, international aid",South Karinamouth,Ph.D.
146,Bradley Ruiz,Hotel manager,East Kevin,Ph.D.
147,Emily Stewart,Hotel manager,South Karinamouth,Ph.D.
148,Christine Frazier,"Development worker, international aid",South Karinamouth,Ph.D.
149,Regina Harrington,Occupational psychologist,East Kevin,Ph.D.